install.packages('neuralnet')
library(neuralnet)

some <- read.csv('DB/good.csv', header = T)
str(some)
head(some)
dim(some) # 100   4

# scale() 함수 : 표준화 변환
# min-max 정규화 :최소값을 0으로 만들고, 제일큰값을 1로 만듦
# 10 20 30 -> 0 0.5 1
# 10 20 30 40 50 -> 0 0.25 0.5 0.75 1

normalize <- function(x){ # min-max 정규화
  return ((x - min(x))/(max(x)-min(x)))
}
#a <- data.frame(c(10,20,30))
#lapply( a, normalize) # 0.0 0.5 1.0
#b <- data.frame(c(50,40,10,20,30))
#lapply( b, normalize) # 1.00 0.75 0.00 0.25 0.50

# norm : normalization의 약자
some_norm <- as.data.frame(lapply(some, normalize))
head(some_norm)
#식도락_관광.1    쇼핑.2 자연경관_감상.1 업무수행.1 고궁_역사유적_방문.1 공연_민속행사_축제참가_및_관람 전통문화체험 테마파크.1 유흥_오락.1 박물관_전시관_방문 연수_교육_연구 스포츠활동 휴양_휴식
#1    0.00000000 0.4129693       0.0000000  0.1952663            0.1481481                    0.125000000   0.00000000 0.04615385  0.04347826         0.28571429      0.3235294 0.46052632 0.3703704
#2    0.03095238 0.5460751       0.0617284  0.3017751            0.1296296                    0.009615385   0.08571429 0.10769231  0.00000000         0.42857143      0.2941176 0.25000000 0.4074074
#3    0.07380952 0.6894198       0.4074074  0.3550296            0.5277778                    0.394230769   0.02857143 0.18461538  0.10869565         0.02857143      0.3529412 0.02631579 0.2592593
#4    0.08571429 0.8737201       0.4814815  0.1952663            0.5925926                    0.134615385   0.05714286 0.15384615  0.17391304         0.20000000      0.3529412 0.06578947 0.5925926
#5    0.16904762 0.6860068       0.5246914  0.4674556            0.2962963                    0.153846154   0.02857143 0.21538462  0.50000000         0.45714286      0.3529412 0.05263158 0.4814815
#6    0.09285714 0.9215017       0.4629630  0.1301775            0.3333333                    0.019230769   0.31428571 0.30769231  0.19565217         0.37142857      0.5588235 0.05263158 0.3333333
#시티투어_버스_이용 뷰티관광.1   의료관광 레포츠활동 시찰.산업시설등.
#1          0.2142857  0.3333333 0.23529412  0.2105263       0.04545455
#2          0.2142857  0.2857143 0.05882353  0.2631579       0.00000000
#3          0.1428571  0.1904762 0.11764706  0.3157895       0.13636364
#4          0.3928571  0.6666667 0.11764706  0.7894737       0.09090909
#5          0.2857143  0.0952381 0.23529412  0.2105263       0.18181818
#6          0.3928571  0.1904762 0.17647059  0.5789474       0.27272727

some_norm <- some_norm[c('식도락_관광.1','쇼핑.2')]
head(some_norm)
#    식도락_관광.1    쇼핑.2
#1    0.00000000 0.4129693
#2    0.03095238 0.5460751
#3    0.07380952 0.6894198
#4    0.08571429 0.8737201
#5    0.16904762 0.6860068
#6    0.09285714 0.9215017

# 데이터분리(3:1)
train_row <- round(0.75*nrow(some))#45

training <- some_norm[1:train_row, ]#1~45까지의놂값
testing <- some_norm[(train_row + 1):nrow(some), ]#46~60까지의 놂값

library(neuralnet)

#formula: y ~ x 형식으로 반응(종속) 변수와 설명(독립) 변수 수식
myformula <- 쇼핑.2 ~ 식도락_관광.1 

#hidden : 은닉층의 노드수를 지정한다
#만약 hidden = c(5,3)라고 하면 1번째 히든 레이어는 5개의 노드를, 2번째 히든 레이어는 노 드가 3개가 된다.
#data : 모델생성에 사용될 데이터셋을 지정한다.
model <- neuralnet(formula = myformula, data = training, hidden = c(2, 2))
plot(model)

#모델을 점검하기위한 데이터를 주고 확인해보기
#compute()함수: 인공신경망 모델의 테스팅 데이터에 대한 예측치를 구해주는 함수이다.
head(testing)
model_result <- compute(model, testing[1:1])
attributes(model_result) #"neurons"    "net.result"
#neurons: 망에서 각층에있는 뉴런정보를 가지고 있다.
# net.result : 분류에 대한 모델의 예측값을 가지고 있다.

prediction <- model_result$net.result
prediction # 예측값

df <- data.frame(predict = prediction, real = testing$쇼핑.2)
head(df)
#    predict      real
#46 0.7570004 0.5324232
#47 0.7337914 0.6587031
#48 0.7314843 0.6450512
#49 0.8190483 0.3344710
#50 0.8497564 0.2935154
#51 0.8862042 0.7815700

식도락_관광.1 <- seq(1:length(prediction))
plot(x=식도락_관광.1, y=prediction, type='n', xlab='', ylab='value', ylim=c(0,1))
points(식도락_관광.1, prediction, pch=4, col='red')
points(식도락_관광.1, testing$쇼핑.2, pch=4, col='blue')

cor(prediction, testing$쇼핑.2) 